RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Source/gd32h7xx_dma.c
    /* disable synchronization mode and event generation for DMA request forward number configuration */
    DMAMUX_RM_CHXCFG(channelx) &= ~(DMAMUX_RM_CHXCFG_SYNCEN | DMAMUX_RM_CHXCFG_EVGEN);

    /* configure synchronization input identification, synchronization input polarity, number of DMA requests to forward */
    cfg = DMAMUX_RM_CHXCFG(channelx);
    cfg &= ~(DMAMUX_RM_CHXCFG_SYNCID | DMAMUX_RM_CHXCFG_NBR | DMAMUX_RM_CHXCFG_SYNCP);
    cfg |= (init_struct->sync_polarity | (init_struct->sync_id) | RM_CHXCFG_NBR(init_struct->request_number - 1U));
    DMAMUX_RM_CHXCFG(channelx) = cfg;
}

/*!
    \brief      enable synchronization mode
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dmamux_synchronization_enable(dmamux_multiplexer_channel_enum channelx)
{
    DMAMUX_RM_CHXCFG(channelx) |= DMAMUX_RM_CHXCFG_SYNCEN;
}

/*!
    \brief      disable synchronization mode
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dmamux_synchronization_disable(dmamux_multiplexer_channel_enum channelx)
{
    DMAMUX_RM_CHXCFG(channelx) &= (~DMAMUX_RM_CHXCFG_SYNCEN);
}
/*!
    \brief      enable event generation
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dmamux_event_generation_enable(dmamux_multiplexer_channel_enum channelx)
{
    DMAMUX_RM_CHXCFG(channelx) |= DMAMUX_RM_CHXCFG_EVGEN;
}

/*!
    \brief      disable event generation
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dmamux_event_generation_disable(dmamux_multiplexer_channel_enum channelx)
{
    DMAMUX_RM_CHXCFG(channelx) &= (~DMAMUX_RM_CHXCFG_EVGEN);
}

/*!
    \brief      initialize the parameters of DMAMUX request generator structure with the default values
    \param[in]  none
    \param[out] init_struct: the initialization data needed to initialize DMAMUX request generator channel
    \retval     none
*/
void dmamux_gen_struct_para_init(dmamux_gen_parameter_struct *init_struct)
{
    if(NULL == init_struct) {
        DMA_WRONG_HANDLE
    }

    /* set the DMAMUX request generator structure with the default values */
    init_struct->trigger_id        = DMAMUX_SYNC_EVT0_OUT;
    init_struct->trigger_polarity  = DMAMUX_SYNC_RISING;
    init_struct->request_number = 1U;
}

/*!
    \brief      initialize DMAMUX request generator channel
    \param[in]  channelx: specify which DMAMUX request generator channel is initialized
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[in]  init_struct: the data needed to initialize DMAMUX request generator channel
                  trigger_id: DMAMUX_TRIGGER_EXTI0, DMAMUX_TRIGGER_EXTI1, DMAMUX_TRIGGER_EXTI2, DMAMUX_TRIGGER_EXTI3,
                              DMAMUX_TRIGGER_EXTI4, DMAMUX_TRIGGER_EXTI5, DMAMUX_TRIGGER_EXTI6, DMAMUX_TRIGGER_EXTI7,
                              DMAMUX_TRIGGER_EXTI8, DMAMUX_TRIGGER_EXTI9, DMAMUX_TRIGGER_EXTI10, DMAMUX_TRIGGER_EXTI11,
                              DMAMUX_TRIGGER_EXTI12, DMAMUX_TRIGGER_EXTI13, DMAMUX_TRIGGER_EXTI14, DMAMUX_TRIGGER_EXTI15,
                              DMAMUX_TRIGGER_EVT0_OUT, DMAMUX_TRIGGER_EVT1_OUT, DMAMUX_TRIGGER_EVT2_OUT, DMAMUX_TRIGGER_EVT3_OUT,
                              DMAMUX_SYNC_EVT4_OUT, DMAMUX_SYNC_EVT5_OUT, DMAMUX_SYNC_EVT6_OUT, DMAMUX_SYNC_RTC_WAKEUP,
                              DMAMUX_SYNC_CMP0_OUTPUT, DMAMUX_SYNC_I2C0_WAKEUP, DMAMUX_SYNC_I2C1_WAKEUP, DMAMUX_SYNC_I2C2_WAKEUP,
                              DMAMUX_SYNC_I2C3_WAKEUP
                  trigger_polarity: DMAMUX_GEN_NO_EVENT, DMAMUX_GEN_RISING, DMAMUX_GEN_FALLING, DMAMUX_GEN_RISING_FALLING
                  request_number: the number of DMA request that will be generated after a signal event, from 1 to 32
    \param[out] none
    \retval     none
*/
void dmamux_request_generator_init(dmamux_generator_channel_enum channelx, dmamux_gen_parameter_struct *init_struct)
{
    uint32_t cfg;

    if(NULL == init_struct) {
        DMA_WRONG_HANDLE
    }

    /* disable DMAMUX request generator channel for DMA request generation number configuration */
    DMAMUX_RG_CHXCFG(channelx) &= ~(DMAMUX_RG_CHXCFG_RGEN);

    /* configure trigger input identification, trigger polarity, number of DMA requests to be generated */
    cfg = DMAMUX_RG_CHXCFG(channelx);
    cfg &= ~(DMAMUX_RG_CHXCFG_TID | DMAMUX_RG_CHXCFG_NBRG | DMAMUX_RG_CHXCFG_RGTP);
    cfg |= (RG_CHXCFG_NBRG(init_struct->request_number - 1U) | init_struct->trigger_id | init_struct->trigger_polarity);
    DMAMUX_RG_CHXCFG(channelx) = cfg;
}

/*!
    \brief      enable DMAMUX request generator channel
    \param[in]  channelx: specify which DMAMUX request generator channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dmamux_request_generator_channel_enable(dmamux_generator_channel_enum channelx)
{
    DMAMUX_RG_CHXCFG(channelx) |= DMAMUX_RG_CHXCFG_RGEN;
}

/*!
    \brief      disable DMAMUX request generator channel
    \param[in]  channelx: specify which DMAMUX request generator channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dmamux_request_generator_channel_disable(dmamux_generator_channel_enum channelx)
{
    DMAMUX_RG_CHXCFG(channelx) &= (~DMAMUX_RG_CHXCFG_RGEN);
}

/*!
    \brief      configure synchronization input polarity
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[in]  polarity: synchronization input polarity
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_SYNC_NO_EVENT: no event detection
      \arg        DMAMUX_SYNC_RISING: rising edge
      \arg        DMAMUX_SYNC_FALLING: falling edge
      \arg        DMAMUX_SYNC_RISING_FALLING: rising and falling edges
    \param[out] none
    \retval     none
*/
void dmamux_synchronization_polarity_config(dmamux_multiplexer_channel_enum channelx, uint32_t polarity)
{
    DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_SYNCP;
    DMAMUX_RM_CHXCFG(channelx) |= polarity;
}

/*!
    \brief      configure number of DMA requests to forward
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[in]  number: DMA requests number to forward
                only one parameter can be selected which is shown as below:
      \arg        1 - 32
    \param[out] none
    \retval     none
*/
void dmamux_request_forward_number_config(dmamux_multiplexer_channel_enum channelx, uint32_t number)
{
    DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_NBR;
    DMAMUX_RM_CHXCFG(channelx) |= ((number - 1U) << RM_CHXCFG_NBR_OFFSET);
}

/*!
    \brief      configure synchronization input identification
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[in]  id: synchronization input identification
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_SYNC_EXTI0: synchronization input is EXTI0
      \arg        DMAMUX_SYNC_EXTI1: synchronization input is EXTI1
      \arg        DMAMUX_SYNC_EXTI2: synchronization input is EXTI2
      \arg        DMAMUX_SYNC_EXTI3: synchronization input is EXTI3
      \arg        DMAMUX_SYNC_EXTI4: synchronization input is EXTI4
      \arg        DMAMUX_SYNC_EXTI5: synchronization input is EXTI5
      \arg        DMAMUX_SYNC_EXTI6: synchronization input is EXTI6
      \arg        DMAMUX_SYNC_EXTI7: synchronization input is EXTI7
      \arg        DMAMUX_SYNC_EXTI8: synchronization input is EXTI8
      \arg        DMAMUX_SYNC_EXTI9: synchronization input is EXTI9
      \arg        DMAMUX_SYNC_EXTI10: synchronization input is EXTI10
      \arg        DMAMUX_SYNC_EXTI11: synchronization input is EXTI11
      \arg        DMAMUX_SYNC_EXTI12: synchronization input is EXTI12
      \arg        DMAMUX_SYNC_EXTI13: synchronization input is EXTI13
      \arg        DMAMUX_SYNC_EXTI14: synchronization input is EXTI14
      \arg        DMAMUX_SYNC_EXTI15: synchronization input is EXTI15
      \arg        DMAMUX_SYNC_EVT0_OUT: synchronization input is Evt0_out
      \arg        DMAMUX_SYNC_EVT1_OUT: synchronization input is Evt1_out
      \arg        DMAMUX_SYNC_EVT2_OUT: synchronization input is Evt2_out
      \arg        DMAMUX_SYNC_EVT3_OUT: synchronization input is Evt3_out
      \arg        DMAMUX_SYNC_EVT4_OUT: synchronization input is Evt4_out
      \arg        DMAMUX_SYNC_EVT5_OUT: synchronization input is Evt5_out
      \arg        DMAMUX_SYNC_EVT6_OUT: synchronization input is Evt6_out
      \arg        DMAMUX_SYNC_RTC_WAKEUP: synchronization input is RTC wakeup
      \arg        DMAMUX_SYNC_CMP0_OUTPUT: synchronization input is CMP0 output
      \arg        DMAMUX_SYNC_I2C0_WAKEUP: synchronization input is I2C0 wakeup
      \arg        DMAMUX_SYNC_I2C1_WAKEUP: synchronization input is I2C1 wakeup
      \arg        DMAMUX_SYNC_I2C2_WAKEUP: synchronization input is I2C2 wakeup
      \arg        DMAMUX_SYNC_I2C3_WAKEUP: synchronization input is I2C3 wakeup
    \param[out] none
    \retval     none
*/
void dmamux_sync_id_config(dmamux_multiplexer_channel_enum channelx, uint32_t id)
{
    DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_SYNCID;
    DMAMUX_RM_CHXCFG(channelx) |= id;
}

/*!
    \brief      configure multiplexer input identification
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[in]  id: input DMA request identification
                only one parameter can be selected which is shown as below:
      \arg        DMA_REQUEST_M2M: memory to memory transfer
      \arg        DMA_REQUEST_GENERATOR0: DMAMUX request generator 0
      \arg        DMA_REQUEST_GENERATOR1: DMAMUX request generator 1
      \arg        DMA_REQUEST_GENERATOR2: DMAMUX request generator 2
      \arg        DMA_REQUEST_GENERATOR3: DMAMUX request generator 3
      \arg        DMA_REQUEST_GENERATOR4: DMAMUX request generator 4
      \arg        DMA_REQUEST_GENERATOR5: DMAMUX request generator 5
      \arg        DMA_REQUEST_GENERATOR6: DMAMUX request generator 6
      \arg        DMA_REQUEST_GENERATOR7: DMAMUX request generator 7
      \arg        DMA_REQUEST_ADC0: DMAMUX ADC0 request
      \arg        DMA_REQUEST_ADC1: DMAMUX ADC1 request
      \arg        DMA_REQUEST_TIMER0_CH0: DMAMUX TIMER0 CH0 request
      \arg        DMA_REQUEST_TIMER0_CH1: DMAMUX TIMER0 CH1 request
      \arg        DMA_REQUEST_TIMER0_CH2: DMAMUX TIMER0 CH2 request
      \arg        DMA_REQUEST_TIMER0_CH3: DMAMUX TIMER0 CH3 request
      \arg        DMA_REQUEST_TIMER0_MCH0: DMAMUX TIMER0 MCH0 request
      \arg        DMA_REQUEST_TIMER0_MCH1: DMAMUX TIMER0 MCH1 request
      \arg        DMA_REQUEST_TIMER0_MCH2: DMAMUX TIMER0 MCH2 request
      \arg        DMA_REQUEST_TIMER0_MCH3: DMAMUX TIMER0 MCH3 request
      \arg        DMA_REQUEST_TIMER0_UP: DMAMUX TIMER0 UP request
      \arg        DMA_REQUEST_TIMER0_TRG: DMAMUX TIMER0 TRG request
      \arg        DMA_REQUEST_TIMER0_CMT: DMAMUX TIMER0 CMT request
      \arg        DMA_REQUEST_TIMER1_CH0: DMAMUX TIMER1 CH0 request
      \arg        DMA_REQUEST_TIMER1_CH1: DMAMUX TIMER1 CH1 request
      \arg        DMA_REQUEST_TIMER1_CH2: DMAMUX TIMER1 CH2 request
      \arg        DMA_REQUEST_TIMER1_CH3: DMAMUX TIMER1 CH3 request
      \arg        DMA_REQUEST_TIMER1_UP: DMAMUX TIMER1 UP request
      \arg        DMA_REQUEST_TIMER1_TRG: DMAMUX TIMER1 TRG request
      \arg        DMA_REQUEST_TIMER2_CH0: DMAMUX TIMER2 CH0 request
      \arg        DMA_REQUEST_TIMER2_CH1: DMAMUX TIMER2 CH1 request
      \arg        DMA_REQUEST_TIMER2_CH2: DMAMUX TIMER2 CH2 request
      \arg        DMA_REQUEST_TIMER2_CH3: DMAMUX TIMER2 CH3 request
      \arg        DMA_REQUEST_TIMER2_UP: DMAMUX TIMER2 UP request
      \arg        DMA_REQUEST_TIMER2_TRG: DMAMUX TIMER2 TRG request
      \arg        DMA_REQUEST_TIMER3_CH0: DMAMUX TIMER3 CH0 request
      \arg        DMA_REQUEST_TIMER3_CH1: DMAMUX TIMER3 CH1 request
      \arg        DMA_REQUEST_TIMER3_CH2: DMAMUX TIMER3 CH2 request
      \arg        DMA_REQUEST_TIMER3_CH3: DMAMUX TIMER3 CH3 request
      \arg        DMA_REQUEST_TIMER3_TRG: DMAMUX TIMER3 TRG request
      \arg        DMA_REQUEST_TIMER3_UP: DMAMUX TIMER3 UP request
      \arg        DMA_REQUEST_I2C0_RX: DMAMUX I2C0 RX request
      \arg        DMA_REQUEST_I2C0_TX: DMAMUX I2C0 TX request
      \arg        DMA_REQUEST_I2C1_RX: DMAMUX I2C1 RX request
      \arg        DMA_REQUEST_I2C1_TX: DMAMUX I2C1 TX request
      \arg        DMA_REQUEST_SPI0_RX: DMAMUX SPI0 RX request
      \arg        DMA_REQUEST_SPI0_TX: DMAMUX SPI0 TX request
      \arg        DMA_REQUEST_SPI1_RX: DMAMUX SPI1 RX request
      \arg        DMA_REQUEST_SPI1_TX: DMAMUX SPI1 TX request
      \arg        DMA_REQUEST_USART0_RX: DMAMUX USART0 RX request
      \arg        DMA_REQUEST_USART0_TX: DMAMUX USART0 TX request
      \arg        DMA_REQUEST_USART1_RX: DMAMUX USART1 RX request
      \arg        DMA_REQUEST_USART1_TX: DMAMUX USART1 TX request
      \arg        DMA_REQUEST_USART2_RX: DMAMUX USART2 RX request
      \arg        DMA_REQUEST_USART2_TX: DMAMUX USART2 TX request
      \arg        DMA_REQUEST_TIMER7_CH0: DMAMUX TIMER7 CH0 request
      \arg        DMA_REQUEST_TIMER7_CH1: DMAMUX TIMER7 CH1 request
      \arg        DMA_REQUEST_TIMER7_CH2: DMAMUX TIMER7 CH2 request
      \arg        DMA_REQUEST_TIMER7_CH3: DMAMUX TIMER7 CH3 request
      \arg        DMA_REQUEST_TIMER7_MCH0: DMAMUX TIMER7 MCH0 request
      \arg        DMA_REQUEST_TIMER7_MCH1: DMAMUX TIMER7 MCH1 request
      \arg        DMA_REQUEST_TIMER7_MCH2: DMAMUX TIMER7 MCH2 request
      \arg        DMA_REQUEST_TIMER7_MCH3: DMAMUX TIMER7 MCH3 request
      \arg        DMA_REQUEST_TIMER7_UP: DMAMUX TIMER7 UP request
      \arg        DMA_REQUEST_TIMER7_TRG: DMAMUX TIMER7 TRG request
      \arg        DMA_REQUEST_TIMER7_CMT: DMAMUX TIMER7 CMT request
      \arg        DMA_REQUEST_TIMER4_CH0: DMAMUX TIMER4 CH0 request
      \arg        DMA_REQUEST_TIMER4_CH1: DMAMUX TIMER4 CH1 request
      \arg        DMA_REQUEST_TIMER4_CH2: DMAMUX TIMER4 CH2 request
      \arg        DMA_REQUEST_TIMER4_CH3: DMAMUX TIMER4 CH3 request
      \arg        DMA_REQUEST_TIMER4_UP: DMAMUX TIMER4 UP request
      \arg        DMA_REQUEST_TIMER4_CMT: DMAMUX TIMER4 CMT request
      \arg        DMA_REQUEST_TIMER4_TRG: DMAMUX TIMER4 TRG request
      \arg        DMA_REQUEST_SPI2_RX: DMAMUX SPI2 RX request
      \arg        DMA_REQUEST_SPI2_TX: DMAMUX SPI2 TX request
      \arg        DMA_REQUEST_UART3_RX: DMAMUX UART3 RX request
      \arg        DMA_REQUEST_UART3_TX: DMAMUX UART3 TX request
      \arg        DMA_REQUEST_UART4_RX: DMAMUX UART4 RX request
      \arg        DMA_REQUEST_UART4_TX: DMAMUX UART4 TX request
      \arg        DMA_REQUEST_DAC_CH0: DMAMUX DAC CH0 request
      \arg        DMA_REQUEST_DAC_CH1: DMAMUX DAC CH1 request
      \arg        DMA_REQUEST_TIMER5_UP: DMAMUX TIMER5 UP request
      \arg        DMA_REQUEST_TIMER6_UP: DMAMUX TIMER6 UP request
      \arg        DMA_REQUEST_USART5_RX: DMAMUX USART5 RX request
      \arg        DMA_REQUEST_USART5_TX: DMAMUX USART5 TX request
      \arg        DMA_REQUEST_I2C2_RX: DMAMUX I2C2 RX request
      \arg        DMA_REQUEST_I2C2_TX: DMAMUX I2C2 TX request
      \arg        DMA_REQUEST_DCI: DMAMUX DCI request
      \arg        DMA_REQUEST_CAU_IN: DMAMUX CAU IN request
      \arg        DMA_REQUEST_CAU_OUT: DMAMUX CAU OUT request
      \arg        DMA_REQUEST_HAU_IN: DMAMUX HAU IN request
      \arg        DMA_REQUEST_UART6_RX: DMAMUX UART6 RX request
      \arg        DMA_REQUEST_UART6_TX: DMAMUX UART6 TX request
      \arg        DMA_REQUEST_UART7_RX: DMAMUX UART7 RX request
      \arg        DMA_REQUEST_UART7_TX: DMAMUX UART7 TX request
      \arg        DMA_REQUEST_SPI3_RX: DMAMUX SPI3 RX request
      \arg        DMA_REQUEST_SPI3_TX: DMAMUX SPI3 TX request
      \arg        DMA_REQUEST_SPI4_RX: DMAMUX SPI4 RX request
      \arg        DMA_REQUEST_SPI4_TX: DMAMUX SPI4 TX request
      \arg        DMA_REQUEST_SAI0_B0: DMAMUX SAI0 B0 request
      \arg        DMA_REQUEST_SAI0_B1: DMAMUX SAI0 B1 request
      \arg        DMA_REQUEST_RSPDIF_DATA: DMAMUX RSPDIF DATA request
      \arg        DMA_REQUEST_RSPDIF_CS: DMAMUX RSPDIF CS request
      \arg        DMA_REQUEST_HPDF_FLT0: DMAMUX HPDF FLT0 request
      \arg        DMA_REQUEST_HPDF_FLT1: DMAMUX HPDF FLT1 request
      \arg        DMA_REQUEST_HPDF_FLT2: DMAMUX HPDF FLT2 request
      \arg        DMA_REQUEST_HPDF_FLT3: DMAMUX HPDF FLT3 request
      \arg        DMA_REQUEST_TIMER14_CH0: DMAMUX TIMER14 CH0 request
      \arg        DMA_REQUEST_TIMER14_CH1: DMAMUX TIMER14 CH1 request
      \arg        DMA_REQUEST_TIMER14_MCH0: DMAMUX TIMER14 MCH0 request
      \arg        DMA_REQUEST_TIMER14_UP: DMAMUX TIMER14 UP request
      \arg        DMA_REQUEST_TIMER14_TRG: DMAMUX TIMER14 TRG request
      \arg        DMA_REQUEST_TIMER14_CMT: DMAMUX TIMER14 CMT request
      \arg        DMA_REQUEST_TIMER15_CH0: DMAMUX TIMER15 CH0 request
      \arg        DMA_REQUEST_TIMER15_MCH0: DMAMUX TIMER15 MCH0 request
      \arg        DMA_REQUEST_TIMER15_UP: DMAMUX TIMER15 UP request
      \arg        DMA_REQUEST_TIMER16_CH0: DMAMUX TIMER16 CH0 request
      \arg        DMA_REQUEST_TIMER16_MCH0: DMAMUX TIMER16 MCH0 request
      \arg        DMA_REQUEST_TIMER16_UP: DMAMUX TIMER16 TRG request
      \arg        DMA_REQUEST_ADC2: DMAMUX ADC2 request
      \arg        DMA_REQUEST_FAC_READ: DMAMUX FAC READ request
      \arg        DMA_REQUEST_FAC_WRITE: DMAMUX FAC WRITE request
      \arg        DMA_REQUEST_TMU_INPUT: DMAMUX TMU INPUT request
      \arg        DMA_REQUEST_TMU_OUTPUT: DMAMUX TMU OUTPUT request
      \arg        DMA_REQUEST_TIMER22_CH0: DMAMUX TIMER22 CH0 request
      \arg        DMA_REQUEST_TIMER22_CH1: DMAMUX TIMER22 CH1 request
      \arg        DMA_REQUEST_TIMER22_CH2: DMAMUX TIMER22 CH2 request
      \arg        DMA_REQUEST_TIMER22_CH3: DMAMUX TIMER22 CH3 request
      \arg        DMA_REQUEST_TIMER22_UP: DMAMUX TIMER22 UP request
      \arg        DMA_REQUEST_TIMER22_TRG: DMAMUX TIMER22 TRG request
      \arg        DMA_REQUEST_TIMER23_CH0: DMAMUX TIMER23 CH0 request
      \arg        DMA_REQUEST_TIMER23_CH1: DMAMUX TIMER23 CH1 request
      \arg        DMA_REQUEST_TIMER23_CH2: DMAMUX TIMER23 CH2 request
      \arg        DMA_REQUEST_TIMER23_CH3: DMAMUX TIMER23 CH3 request
      \arg        DMA_REQUEST_TIMER23_UP: DMAMUX TIMER23 UP request
      \arg        DMA_REQUEST_TIMER23_TRG: DMAMUX TIMER23 TRG request
      \arg        DMA_REQUEST_TIMER30_CH0: DMAMUX TIMER30 CH0 request
      \arg        DMA_REQUEST_TIMER30_CH1: DMAMUX TIMER30 CH1 request
      \arg        DMA_REQUEST_TIMER30_CH2: DMAMUX TIMER30 CH2 request
      \arg        DMA_REQUEST_TIMER30_CH3: DMAMUX TIMER30 CH3 request
      \arg        DMA_REQUEST_TIMER30_UP: DMAMUX TIMER30 UP request
      \arg        DMA_REQUEST_TIMER30_TRG: DMAMUX TIMER30 TRG request
      \arg        DMA_REQUEST_TIMER31_CH0: DMAMUX TIMER31 CH0 request
      \arg        DMA_REQUEST_TIMER31_CH1: DMAMUX TIMER31 CH1 request
      \arg        DMA_REQUEST_TIMER31_CH2: DMAMUX TIMER31 CH2 request
      \arg        DMA_REQUEST_TIMER31_CH3: DMAMUX TIMER31 CH3 request
      \arg        DMA_REQUEST_TIMER31_UP: DMAMUX TIMER31 UP request
      \arg        DMA_REQUEST_TIMER31_TRG: DMAMUX TIMER31 TRG request
      \arg        DMA_REQUEST_TIMER40_CH0: DMAMUX TIMER40 CH0 request
      \arg        DMA_REQUEST_TIMER40_MCH0: DMAMUX TIMER40 MCH0 request
      \arg        DMA_REQUEST_TIMER40_CMT: DMAMUX TIMER40 CMT request
      \arg        DMA_REQUEST_TIMER40_UP: DMAMUX TIMER40 UP request
      \arg        DMA_REQUEST_TIMER41_CH0: DMAMUX TIMER41 CH0 request
      \arg        DMA_REQUEST_TIMER41_MCH0: DMAMUX TIMER41 MCH0 request
      \arg        DMA_REQUEST_TIMER41_CMT: DMAMUX TIMER41 CMT request
      \arg        DMA_REQUEST_TIMER41_UP: DMAMUX TIMER41 UP request
      \arg        DMA_REQUEST_TIMER42_CH0: DMAMUX TIMER42 CH0 request
      \arg        DMA_REQUEST_TIMER42_MCH0: DMAMUX TIMER42 MCH0 request
      \arg        DMA_REQUEST_TIMER42_CMT: DMAMUX TIMER42 CMT request
      \arg        DMA_REQUEST_TIMER42_UP: DMAMUX TIMER42 UP request
      \arg        DMA_REQUEST_TIMER43_CH0: DMAMUX TIMER43 CH0 request
      \arg        DMA_REQUEST_TIMER43_MCH0: DMAMUX TIMER43 MCH0 request
      \arg        DMA_REQUEST_TIMER43_CMT: DMAMUX TIMER43 CMT request
      \arg        DMA_REQUEST_TIMER43_UP: DMAMUX TIMER43 UP request
      \arg        DMA_REQUEST_TIMER44_CH0: DMAMUX TIMER44 CH0 request
      \arg        DMA_REQUEST_TIMER44_MCH0: DMAMUX TIMER44 MCH0 request
      \arg        DMA_REQUEST_TIMER44_CMT: DMAMUX TIMER44 CMT request
      \arg        DMA_REQUEST_TIMER44_UP: DMAMUX TIMER44 UP request
      \arg        DMA_REQUEST_TIMER50_UP: DMAMUX TIMER50 UP request
      \arg        DMA_REQUEST_TIMER51_UP: DMAMUX TIMER51 UP request
      \arg        DMA_REQUEST_SAI1_B0: DMAMUX SAI1 B0 request
      \arg        DMA_REQUEST_SAI1_B1: DMAMUX SAI1 B1 request
      \arg        DMA_REQUEST_SAI2_B0: DMAMUX SAI2 B0 request
      \arg        DMA_REQUEST_SAI2_B1: DMAMUX SAI2 B1 request
      \arg        DMA_REQUEST_SPI5_RX: DMAMUX SPI5 RX request
      \arg        DMA_REQUEST_SPI5_TX: DMAMUX SPI5 TX request
      \arg        DMA_REQUEST_I2C3_RX: DMAMUX I2C3 RX request
      \arg        DMA_REQUEST_I2C3_TX: DMAMUX I2C3 TX request
      \arg        DMA_REQUEST_CAN0: DMAMUX CAN0 request
      \arg        DMA_REQUEST_CAN1: DMAMUX CAN1 request
      \arg        DMA_REQUEST_CAN2: DMAMUX CAN2 request
      \arg        DMA_REQUEST_TIMER40_CH1: DMAMUX TIMER40 CH1 request
      \arg        DMA_REQUEST_TIMER40_TRG: DMAMUX TIMER40 TRG request
      \arg        DMA_REQUEST_TIMER41_CH1: DMAMUX TIMER41 CH1 request
      \arg        DMA_REQUEST_TIMER41_TRG: DMAMUX TIMER41 TRG request
      \arg        DMA_REQUEST_TIMER42_CH1: DMAMUX TIMER42 CH1 request
      \arg        DMA_REQUEST_TIMER42_TRG: DMAMUX TIMER42 TRG request
      \arg        DMA_REQUEST_TIMER43_CH1: DMAMUX TIMER43 CH1 request
      \arg        DMA_REQUEST_TIMER43_TRG: DMAMUX TIMER43 TRG request
      \arg        DMA_REQUEST_TIMER44_CH1: DMAMUX TIMER44 CH1 request
      \arg        DMA_REQUEST_TIMER44_TRG: DMAMUX TIMER44 TRG request
    \param[out] none
    \retval     none
*/
void dmamux_request_id_config(dmamux_multiplexer_channel_enum channelx, uint32_t id)
{
    DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_MUXID;
    DMAMUX_RM_CHXCFG(channelx) |= id;
}

